app/views/tasks/create.js.erb

//alert("aty jerena service");
document.getElementById('<%=@category.title%>').insertAdjacentHTML("beforeend", "<%= j render 'task_list', task_list: @task%>")
---
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-28 13:11:51.774580"], ["updated_at", "2019-08-28 13:11:51.774580"], ["title", "totakely b0"], ["deadline", "2019-08-26 00:00:00"], ["category_id", 1]]