app/controllers/email_controller.rb

	def show
	   puts @e = Email.all[params[:id].to_i]
---
SELECT "emails".* FROM "emails"