app/controllers/email_controller.rb

	def index
		@Emails = Email.all
---
SELECT "emails".* FROM "emails"

	def show
		puts "*"*90
	   puts @e = Email.find(params[:id])
	   @e.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 12:12:04.328878"], ["id", 118]]

	def create
		@e = Email.new(object: Faker::Book.title,body: Faker::Book.title, read:false)
	 if @e.save
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "For Whom the Bell Tolls"], ["body", "The Lathe of Heaven"], ["created_at", "2019-08-30 12:16:29.076517"], ["updated_at", "2019-08-30 12:16:29.076517"], ["read", false]]

	def destroy
		@e =Email.find(params[:id])
		@e.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 2]]

	def update
		puts params[:read]
		@e =Email.find(params[:id])
		if (@e.read == true)
			@e.update(read: false)
		else
			@e.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 120], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2019-08-30 12:49:55.486021"], ["id", 128]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2019-08-30 12:49:57.547929"], ["id", 128]]