app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 142], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2019-08-28 23:33:44.842904"], ["id", 142]]
---
  def update
    puts "*"*90
    puts params[:ok]
    @task = Task.find(params[:id])
    @task.update(status: params[:ok])