app/views/email/create.js.erb

console.log(document.querySelector('.one'))
document.querySelector('.one').insertAdjacentHTML("beforeend", " <%=j render 'email_list', email_list: @e %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Ego Dominus Tuus"], ["body", "In Dubious Battle"], ["created_at", "2019-08-30 06:26:17.282592"], ["updated_at", "2019-08-30 06:26:17.282592"]]